ERP.belugaerp/src/InformationRegisters/бг_МенеджерыПунктовНазначения/бг_МенеджерыПунктовНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_МенеджерыПунктовНазначения</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>МаршрутТорговогоПредставителя</name>
    <type>
      <types>CatalogRef.бг_МаршрутыТорговыхПредставителей</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакЭТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_МенеджерыПунктовНазначения/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает структуру с данными записи регистра Менеджеры пунктов назначения
//
// Параметры:
//  ПунктНазначения - Справочник.битПунктыНазначения
//  Менеджер - Справочник.ФизическиеЛица
//
// Возвращаемое значение:
//  Структура
//
Функция НайтиЗаписьМенеджераПунктаНазначения(ПунктНазначения, Менеджер = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеЗаписи = ДанныеЗаписиРегистра();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПунктНазначения", ПунктНазначения);
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	бг_МенеджерыПунктовНазначенияСрезПоследних.Период КАК Период,
	|	бг_МенеджерыПунктовНазначенияСрезПоследних.ПунктНазначения КАК ПунктНазначения,
	|	бг_МенеджерыПунктовНазначенияСрезПоследних.Менеджер КАК Менеджер,
	|	бг_МенеджерыПунктовНазначенияСрезПоследних.МаршрутТорговогоПредставителя КАК МаршрутТорговогоПредставителя,
	|	бг_МенеджерыПунктовНазначенияСрезПоследних.ПризнакЭТК КАК ПризнакЭТК
	|ИЗ
	|	РегистрСведений.бг_МенеджерыПунктовНазначения.СрезПоследних(, ) КАК бг_МенеджерыПунктовНазначенияСрезПоследних
	|ГДЕ
	|	бг_МенеджерыПунктовНазначенияСрезПоследних.ПунктНазначения = &ПунктНазначения
	|	И &УсловиеПоМенеджеру";
	
	
	Если Менеджер = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоМенеджеру", "ИСТИНА");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоМенеджеру", "бг_МенеджерыПунктовНазначенияСрезПоследних.Менеджер = &Менеджер");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ДанныеЗаписи, Выборка);
	КонецЕсли;
	
	Возврат ДанныеЗаписи;
	
КонецФункции

// Создает запись в регистре Менеджеры пунктов назначения
//
// Параметры:
//  ПунктНазначения - Справочник.битПунктыНазначения
//  Менеджер - Справочник.ФизическиеЛица
//  МаршрутТорговогоПредставителя - Справочник.бг_МаршрутыТорговыхПредставителей
//  ПризнакЭТК - Булево
//  ДатаНачалаДействия - Дата
//
Процедура СоздатьЗаписьМенеджераПунктаНазначения(ПунктНазначения, Менеджер, 
			МаршрутТорговогоПредставителя = Неопределено, ПризнакЭТК = Ложь, ДатаНачалаДействия = Неопределено) Экспорт
			
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.бг_МенеджерыПунктовНазначения.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ПунктНазначения = ПунктНазначения;
	МенеджерЗаписи.Менеджер = Менеджер;
	МенеджерЗаписи.Период = ?(ДатаНачалаДействия = Неопределено, ТекущаяДатаСеанса(), ДатаНачалаДействия);
	МенеджерЗаписи.МаршрутТорговогоПредставителя = МаршрутТорговогоПредставителя;
	МенеджерЗаписи.ПризнакЭТК = ПризнакЭТК;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Возвращает менеджера пункта назначения на указанную дату
//
// Параметры:
//  ПунктНазначения - СправочникСсылка.битПунктыНазначения
//  ДатаСреза - Дата, не обязательный, по умолчанию текущая дата сеанса
// 
// Возвращаемое значение:
//  Менеджер - СправочникСсылка.ФизическиеЛица
//
Функция МенеджерПунктаНазначения(ПунктНазначения, ДатаСреза = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = КонецДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_МенеджерыПунктовНазначенияСрезПоследних.Менеджер КАК Менеджер
	|ИЗ
	|	РегистрСведений.бг_МенеджерыПунктовНазначения.СрезПоследних(&ДатаСреза, ПунктНазначения = &ПунктНазначения) КАК бг_МенеджерыПунктовНазначенияСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("ПунктНазначения", ПунктНазначения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Менеджер;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеЗаписиРегистра()
	
	Возврат Новый Структура("ПунктНазначения, Менеджер, МаршрутТорговогоПредставителя, ПризнакЭТК");
	
КонецФункции

#КонецОбласти
